SELECT ЗАКАЗЫ.Дата_поставки, ТОВАРЫ.*
FROM     ЗАКАЗЫ INNER JOIN
                  ТОВАРЫ ON ЗАКАЗЫ.Наименование_товара = ТОВАРЫ.Наименование
WHERE  (ЗАКАЗЫ.Дата_поставки > CONVERT(DATETIME, '2020-01-21 00:00:00', 102))

SELECT ТОВАРЫ.*
FROM     ТОВАРЫ
WHERE  (Цена BETWEEN 64 AND 319)

SELECT Заказчик, Наименование_товара
FROM     ЗАКАЗЫ
WHERE ([Наименование_товара] = N'Красное бордо')

SELECT Номер_заказа, Наименование_товара AS Товар, Цена_продажи, Количество, Заказчик, Дата_поставки
FROM     ЗАКАЗЫ
WHERE  (Заказчик = N'ИП "Рога и Копыта"')
ORDER BY Дата_поставки